FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПрайсЛистыКонтрагентовЗапрещенныеПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовЗапрещенныеПодразделения</Name>
			<Comment>Прайс-листы контрагентов, с корорыми запрещена работа подразделениям</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контагента, для которого устанавливается запрет работы для подразделения компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПрайсЛистыКонтрагентовЗапрещенныеПодразделения/Ext/ManagerModule.bsl
Функция УстановитьЗапрещенныеПрайсЛистыПодазделений(ПрайсЛист, МассивЗапрещенныхПодразделений)Экспорт 
	Результат = Истина;
	НачатьТранзакцию();
		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛист);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого ЭлементМассива ИЗ МассивЗапрещенныхПодразделений Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПрайсЛист = ПрайсЛист;
		НоваяЗапись.ПодразделениеКомпании = ЭлементМассива;
	КонецЦикла;	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Результат = Ложь;
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	Возврат Результат;
КонецФункции //УстановитьЗапрещенныеПрайсЛистыПодазделений()
